Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ble/building_blocks/peripheral/profiles_services/peripheral_trp_uart_codedPhy/firmware/src/packs/WBZ451_DFP/instance/sercom2.h
/*
 * Instance header file for WBZ451
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-05-31T11:03:01Z */
#ifndef _BZ45_SERCOM2_INSTANCE_
#define _BZ45_SERCOM2_INSTANCE_


/* ========== Instance Parameter definitions for SERCOM2 peripheral ========== */
#define SERCOM2_CLK_REDUCTION                    (1)        
#define SERCOM2_DLY_COMPENSATION                 (1)        
#define SERCOM2_DMA                              (1)        
#define SERCOM2_DMAC_ID_RX                       (8)        
#define SERCOM2_DMAC_ID_TX                       (9)        
#define SERCOM2_FIFO_DEPTH_POWER                 (1)        
#define SERCOM2_GCLK_ID_CORE                     (4)        
#define SERCOM2_INSTANCE_ID                      (67)       
#define SERCOM2_INT_MSB                          (6)        
#define SERCOM2_PMSB                             (3)        
#define SERCOM2_RETENTION_SUPPORT                (0)        
#define SERCOM2_SE_CNT                           (1)        
#define SERCOM2_SPI                              (1)        
#define SERCOM2_SPI_HW_SS_CTRL                   (1)        
#define SERCOM2_SPI_ICSPACE_EXT                  (1)        
#define SERCOM2_SPI_OZMO                         (0)        
#define SERCOM2_SPI_WAKE_ON_SSL                  (1)        
#define SERCOM2_TTBIT_EXTENSION                  (1)        
#define SERCOM2_TWIM                             (1)        
#define SERCOM2_TWIS                             (1)        
#define SERCOM2_TWIS_AUTO_ACK                    (1)        
#define SERCOM2_TWIS_GROUP_CMD                   (1)        
#define SERCOM2_TWIS_SDASETUP_CNT_SIZE           (8)        
#define SERCOM2_TWIS_SDASETUP_SIZE               (4)        
#define SERCOM2_TWIS_SUDAT                       (1)        
#define SERCOM2_TWI_FASTMP                       (1)        
#define SERCOM2_TWI_HSMODE                       (1)        
#define SERCOM2_TWI_SCLSM_MODE                   (1)        
#define SERCOM2_TWI_SMB_TIMEOUTS                 (1)        
#define SERCOM2_TWI_TENBIT_ADR                   (1)        
#define SERCOM2_USART                            (1)        
#define SERCOM2_USART_AUTOBAUD                   (1)        
#define SERCOM2_USART_COLDET                     (1)        
#define SERCOM2_USART_FLOW_CTRL                  (1)        
#define SERCOM2_USART_FRAC_BAUD                  (1)        
#define SERCOM2_USART_IRDA                       (1)        
#define SERCOM2_USART_ISO7816                    (1)        
#define SERCOM2_USART_LIN_MASTER                 (1)        
#define SERCOM2_USART_RS485                      (1)        
#define SERCOM2_USART_SAMPA_EXT                  (1)        
#define SERCOM2_USART_SAMPR_EXT                  (1)        

#endif /* _BZ45_SERCOM2_INSTANCE_ */
